Diplom2/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.Образование</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСерия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортКемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортКогдаВыдан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Отделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПропуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СемейноеПоложение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусГодности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставСемьи</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтепеньРодства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Diplom2/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // Получаем переданного сотрудника
    СсылкаНаСотрудника = Параметры.ТекущийСотрудник;
    
    Если СсылкаНаСотрудника <> Неопределено Тогда
        
        // Получаем объект сотрудника
        СотрудникОбъект = СсылкаНаСотрудника.ПолучитьОбъект();
        
        // Заполняем Наименование (обязательное поле)
        Если НЕ ЗначениеЗаполнено(Объект.Наименование) И ЗначениеЗаполнено(СотрудникОбъект.Наименование) Тогда
            Объект.Наименование = СотрудникОбъект.Наименование;
        КонецЕсли;
        
        // 1. Дата рождения
        Если НЕ ЗначениеЗаполнено(Объект.ДатаРождения) И ЗначениеЗаполнено(СотрудникОбъект.ДатаРождения) Тогда
            Объект.ДатаРождения = СотрудникОбъект.ДатаРождения;
        КонецЕсли;
        
        // 2. Должность
        Если НЕ ЗначениеЗаполнено(Объект.Должность) И ЗначениеЗаполнено(СотрудникОбъект.Должность) Тогда
            Объект.Должность = СотрудникОбъект.Должность;
        КонецЕсли;
        
        // 3. Дата приема
        Если НЕ ЗначениеЗаполнено(Объект.ДатаПриема) И ЗначениеЗаполнено(СотрудникОбъект.ДатаПриемаНаРаботу) Тогда
            Объект.ДатаПриема = СотрудникОбъект.ДатаПриемаНаРаботу;
        КонецЕсли;
        
        // 4. Дата увольнения
        Если НЕ ЗначениеЗаполнено(Объект.ДатаУвольнения) И ЗначениеЗаполнено(СотрудникОбъект.ДатаУвольнения) Тогда
            Объект.ДатаУвольнения = СотрудникОбъект.ДатаУвольнения;
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры

    
&НаКлиенте
Процедура СоставСемьи(Команда)
    Отбор = Новый Структура("Наименование", Объект.Ссылка);
    
    // Передаём отбор в параметры формы списка
    ПараметрыФормы = Новый Структура("Отбор", Отбор);
    
    // Открываем форму списка
    ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаСпискаСоставСемьи", ПараметрыФормы);
       
КонецПроцедуры    

&НаКлиенте
Процедура ВоинскийУчет(Команда)
	 ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка);
    ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВоинскийУчет", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ТрудоваяДеятельность(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
